/*! Distpicker v2.0.7 | (c) 2014-present Chen Fengyuan | MIT */
(function (global, factory) {
  typeof exports === 'object' && typeof module !== 'undefined' ? factory(require('jquery')) :
  typeof define === 'function' && define.amd ? define(['jquery'], factory) :
  (global = typeof globalThis !== 'undefined' ? globalThis : global || self, factory(global.jQuery));
}(this, (function ($) { 'use strict';

  function _interopDefaultLegacy (e) { return e && typeof e === 'object' && 'default' in e ? e : { 'default': e }; }

  var $__default = /*#__PURE__*/_interopDefaultLegacy($);

  function _classCallCheck(instance, Constructor) {
    if (!(instance instanceof Constructor)) {
      throw new TypeError("Cannot call a class as a function");
    }
  }

  function _defineProperties(target, props) {
    for (var i = 0; i < props.length; i++) {
      var descriptor = props[i];
      descriptor.enumerable = descriptor.enumerable || false;
      descriptor.configurable = true;
      if ("value" in descriptor) descriptor.writable = true;
      Object.defineProperty(target, descriptor.key, descriptor);
    }
  }

  function _createClass(Constructor, protoProps, staticProps) {
    if (protoProps) _defineProperties(Constructor.prototype, protoProps);
    if (staticProps) _defineProperties(Constructor, staticProps);
    return Constructor;
  }

  var DEFAULTS = {
    // Selects the districts automatically.
    // 0 -> Disable autoselect
    // 1 -> Autoselect province only
    // 2 -> Autoselect province and city only
    // 3 -> Autoselect all (province, city and district)
    autoselect: 0,
    // Show placeholder.
    placeholder: true,
    // Select value. Options: 'name' and 'code'
    valueType: 'name',
    // Defines the initial value of province.
    province: '—— 学院 ——',
    // Defines the initial value of city.
    city: '—— 专业 ——',
    // Defines the initial value of district.
    district: '—— 班级 ——'
  };

  var DISTRICTS = 
  {100000: {110000: '01 机械学院', 120000: '02 材料学院', 130000: '03 电气学院', 140000: '05 计算机（大数据）学院', 150000: '06 土木学院', 160000: '07 环工学院', 170000: '08 水利学院', 180000: '09 化工学院', 190000: '10 矿业学院', 200000: '11 经管学院', 210000: '1201 文法学院', 220000: '1202 外国语学院', 230000: '1203 马克思学院', 240000: '13 体育学院', 250000: '14 数学学院', 260000: '16 软件学院', 270000: '25 电光学院', 280000: '27 轻纺学院', 290000: '28 艺术学院', 300000: '31 生医学院', 310000: '32 安全学院', 320000: '33 建筑学院', 330000: '34 航空学院', 340000: '35 伍伦贡学院', 350000: '36 宗复学院', 360000: '40 化学学院', 370000: '41 物理学院', 380000: '17 国际学院'}, 110000: {111100: '机械设计制造及其自动化', 111200: '机械电子工程', 111300: '机器人工程', 111400: '车辆工程', 111500: '工程力学', 111600: '机械电子工程（飞机机电系统）'}, 111100: {111111: '机械2201', 111112: '机械2202', 111113: '机械2203', 111114: '机械2204', 111115: '机械2205', 111116: '机械2206', 111117: '机械2207', 111118: '机械2101', 111119: '机械2102', 111120: '机械2103', 111121: '机械2104', 111122: '机械2105', 111123: '机械2106', 111124: '机械2107', 111125: '机械2108', 111126: '机械2109', 111127: '机械Z2110', 111128: '机械2001', 111129: '机械2002', 111130: '机械2003', 111131: '机械2004', 111132: '机械2005', 111133: '机械2006', 111134: '机械2007', 111135: '机械2008', 111136: '机械2009', 111137: '机械Z2010', 111138: '机械1901', 111139: '机械1902', 111140: '机械1903', 111141: '机械1904', 111142: '机械1905', 111143: '机械1906', 111144: '机械1907', 111145: '机械1908', 111146: '机械1909', 111147: '机械Z1910'}, 111200: {111211: '机电2201', 111212: '机电2202', 111213: '机电2203', 111214: '机电2204', 111215: '机电2205', 111216: '机电2206', 111217: '机电2101', 111218: '机电2102', 111219: '机电2103', 111220: '机电2104', 111221: '机电2105', 111222: '机电2106', 111223: '机电2107', 111224: '机电2108', 111225: '机电2001', 111226: '机电2002', 111227: '机电2003', 111228: '机电2004', 111229: '机电2005', 111230: '机电2006', 111231: '机电2007', 111232: '机电2008', 111233: '机电1901', 111234: '机电1902', 111235: '机电1903', 111236: '机电1904', 111237: '机电1905', 111238: '机电1906', 111239: '机电1907', 111240: '机电1908', 111241: '机电1909', 111242: '机电1910', 111243: '机电S1901'}, 111300: {111311: '机器人2201', 111312: '机器人2202', 111313: '机器人2101', 111314: '机器人2102', 111315: '机器人2103', 111316: '机器人2001', 111317: '机器人2002', 111318: '机器人S2001'}, 111400: {111411: '车辆2201', 111412: '车辆2202', 111413: '车辆2203', 111414: '车辆2101', 111415: '车辆2102', 111416: '车辆2103', 111417: '车辆2001', 111418: '车辆2002', 111419: '车辆2003', 111420: '车辆1901', 111421: '车辆1902', 111422: '车辆1903'}, 111500: {111511: '力学2201', 111512: '力学2202', 111513: '力学2203', 111514: '力学2101', 111515: '力学2102', 111516: '力学2103', 111517: '力学2001', 111518: '力学2002', 111519: '力学2003', 111520: '力学1901', 111521: '力学1902', 111522: '力学1903'}, 120000: {121100: '冶金工程', 121200: '金属材料工程', 121300: '材料成型及控制工程', 121400: '材料科学与工程', 121500: '高分子材料与工程', 121600: '材料科学与工程（先进航空材料）'}, 121100: {121111: '冶金2201', 121112: '冶金2202', 121113: '冶金2203', 121114: '冶金2101', 121115: '冶金2102', 121116: '冶金2103', 121117: '冶金2001', 121118: '冶金2002', 121119: '冶金2003', 121120: '冶金1901', 121121: '冶金1902', 121122: '冶金1903', 121123: '冶金1904'}, 121200: {121211: '金材2201', 121212: '金材2202', 121213: '金材2101', 121214: '金材2102', 121215: '金材2001', 121216: '金材2002', 121217: '金材1901', 121218: '金材1902'}, 121300: {121311: '成型2201', 121312: '成型2202', 121313: '成型2203', 121314: '成型2204', 121315: '成型2205', 121316: '成型2206', 121317: '成型2207', 121318: '成型2101', 121319: '成型2102', 121320: '成型2103', 121321: '成型2104', 121322: '成型2105', 121323: '成型Z2106', 121324: '成型Z2107', 121325: '成型2001', 121326: '成型2002', 121327: '成型2003', 121328: '成型2004', 121329: '成型2005', 121330: '成型Z2006', 121331: '成型Z2007', 121332: '成型1901', 121333: '成型1902', 121334: '成型1903', 121335: '成型1904', 121336: '成型1905', 121337: '成型Z1906', 121338: '成型Z1907'}, 121400: {121411: '材科2201', 121412: '材科2202', 121413: '材科2203', 121414: '材科2204', 121415: '材科2205', 121416: '材科2101', 121417: '材科2102', 121418: '材科2103', 121419: '材科2104', 121420: '材科2105', 121421: '材科2106', 121422: '材科2107', 121423: '材科2108', 121424: '材科2001', 121425: '材科2002', 121426: '材科2003', 121427: '材科2004', 121428: '材科2005', 121429: '材科2006', 121430: '材科2007', 121431: '材科2008', 121432: '材科1901', 121433: '材科1902', 121434: '材科1903', 121435: '材科1904', 121436: '材科1905', 121437: '材科1906', 121438: '材科1907', 121439: '材科1908', 121440: '材科1909'}, 121500: {121511: '高材2201', 121512: '高材2202'}, 130000: {131100: '能源与动力工程', 131200: '电气工程及其自动化', 131300: '自动化'}, 131100: {131111: '能源2201', 131112: '能源2202', 131113: '能源2203', 131114: '能源2204', 131115: '能源2101', 131116: '能源2102', 131117: '能源2103', 131118: '能源2104', 131119: '能源2001', 131120: '能源2002', 131121: '能源2003', 131122: '能源2004', 131123: '能源1901', 131124: '能源1902', 131125: '能源1903', 131126: '能源1904'}, 131200: {131211: '电气2201', 131212: '电气2202', 131213: '电气2203', 131214: '电气2204', 131215: '电气2205', 131216: '电气2206', 131217: '电气2207', 131218: '电气2208', 131219: '电气2101', 131220: '电气2102', 131221: '电气2103', 131222: '电气2104', 131223: '电气2105', 131224: '电气2106', 131225: '电气2107', 131226: '电气2108', 131227: '电气2109', 131228: '电气2001', 131229: '电气2002', 131230: '电气2003', 131231: '电气2004', 131232: '电气2005', 131233: '电气2006', 131234: '电气2007', 131235: '电气2008', 131236: '电气S2001', 131237: '电气1901', 131238: '电气1902', 131239: '电气1903', 131240: '电气1904', 131241: '电气1905', 131242: '电气1906', 131243: '电气1907', 131244: '电气1908', 131245: '电气S1901'}, 131300: {131311: '自动化2201', 131312: '自动化2202', 131313: '自动化2203', 131314: '自动化2204', 131315: '自动化2205', 131316: '自动化2206', 131317: '自动化2101', 131318: '自动化2102', 131319: '自动化2103', 131320: '自动化2104', 131321: '自动化2105', 131322: '自动化2106', 131323: '自动化2001', 131324: '自动化2002', 131325: '自动化2003', 131326: '自动化2004', 131327: '自动化2005', 131328: '自动化2006', 131329: '自动化1901', 131330: '自动化1902', 131331: '自动化1903', 131332: '自动化1904', 131333: '自动化1905', 131334: '自动化1906'}, 140000: {141100: '计算机科学与技术', 141200: '物联网工程', 141300: '网络空间安全', 141400: '区块链工程', 141500: '数据科学与大数据技术', 141600: '人工智能', 141700: '智能医学工程', 141800: '信息安全'}, 141100: {141111: '计算机2201', 141112: '计算机2202', 141113: '计算机2203', 141114: '计算机2204', 141115: '计算机Z2105', 141116: '计算机Z2106', 141117: '计算机2101', 141118: '计算机2102', 141119: '计算机2103', 141120: '计算机2104', 141121: '计算机Z2005', 141122: '计算机Z2006', 141123: '计算机2001', 141124: '计算机2002', 141125: '计算机2003', 141126: '计算机2004', 141127: '计算机LY2001', 141128: '计算机LZ2001', 141129: '计算机Z1905', 141130: '计算机Z1906', 141131: '计算机1901', 141132: '计算机1902', 141133: '计算机1903', 141134: '计算机1904'}, 141200: {141211: '物联网2201', 141212: '物联网2202', 141213: '物联网2001', 141214: '物联网2002'}, 141300: {141311: '网安2201', 141312: '网安2202'}, 141400: {141411: '区块链2201', 141412: '区块链2202'}, 141500: {141511: '数科2201', 141512: '数科2202', 141513: '数科2203', 141514: '数科2204', 141515: '数科2101', 141516: '数科2102', 141517: '数科2103', 141518: '数科2104', 141519: '数科2001', 141520: '数科2002', 141521: '数科2003', 141522: '数科2004', 141523: '数科1901', 141524: '数科1902', 141525: '数科1903', 141526: '数科1904'}, 141600: {141611: '智能2201', 141612: '智能2202', 141613: '智能2101', 141614: '智能2102', 141615: '智能2001', 141616: '智能2002'}, 141700: {141711: '医工2201', 141712: '医工2101', 141713: '医工2001'}, 150000: {151100: '土木工程', 151200: '道路桥梁与渡河工程', 151300: '建筑环境与能源应用工程'}, 151100: {151111: '土木2201', 151112: '土木2202', 151113: '土木2203', 151114: '土木2204', 151115: '土木2205', 151116: '土木2101', 151117: '土木2102', 151118: '土木2103', 151119: '土木2104', 151120: '土木2105', 151121: '土木2106', 151122: '土木2107', 151123: '土木2001', 151124: '土木2002', 151125: '土木2003', 151126: '土木2004', 151127: '土木2005', 151128: '土木2006', 151129: '土木S2001', 151130: '土木1901', 151131: '土木1902', 151132: '土木1903', 151133: '土木1904', 151134: '土木1905', 151135: '土木1906', 151136: '土木S1901'}, 151200: {151211: '道桥2201', 151212: '道桥2202', 151213: '道桥2101', 151214: '道桥2102', 151215: '道桥2001', 151216: '道桥2002', 151217: '道桥1901', 151218: '道桥1902'}, 151300: {151311: '暖通2201', 151312: '暖通2202', 151313: '暖通2101', 151314: '暖通2102', 151315: '暖通2103', 151316: '暖通2001', 151317: '暖通2002', 151318: '暖通2003', 151319: '暖通1901', 151320: '暖通1902'}, 160000: {161100: '环境工程', 161200: '给排水科学与工程'}, 161100: {161111: '环工2201', 161112: '环工2202', 161113: '环工2203', 161114: '环工2101', 161115: '环工2102', 161116: '环工2103', 161117: '环工2001', 161118: '环工2002', 161119: '环工2003', 161120: '环工1901', 161121: '环工1902'}, 161200: {161211: '给排水2201', 161212: '给排水2202', 161213: '给排水2203', 161214: '给排水2101', 161215: '给排水2102', 161216: '给排水2001', 161217: '给排水2002', 161218: '给排水1901', 161219: '给排水1902'}, 170000: {171100: '水利水电工程', 171200: '农业水利工程', 171300: '水文与水资源工程'}, 171100: {171111: '水工2201', 171112: '水工2202', 171113: '水工2203', 171114: '水工2101', 171115: '水工2102', 171116: '水工2103', 171117: '水工2001', 171118: '水工2002', 171119: '水工2003', 171120: '水工1901', 171121: '水工1902', 171122: '水工1903'}, 171200: {171211: '农水2201', 171212: '农水2202', 171213: '农水2101', 171214: '农水2102', 171215: '农水2001', 171216: '农水2002', 171217: '农水1901', 171218: '农水1902', 171219: '农水1903'}, 171300: {171311: '水文2201', 171312: '水文2202', 171313: '水文2203', 171314: '水文2101', 171315: '水文2102', 171316: '水文2103', 171317: '水文2001', 171318: '水文2002', 171319: '水文2003', 171320: '水文1901', 171321: '水文1902', 171322: '水文1903'}, 180000: {181100: '化学工程与工艺', 181200: '过程装备与控制工程', 181300: '精细化工'}, 181100: {181111: '化工2201', 181112: '化工2202', 181113: '化工2203', 181114: '化工2204', 181115: '化工2205', 181116: '化工2206', 181117: '化工2101', 181118: '化工2102', 181119: '化工2103', 181120: '化工2104', 181121: '化工Z2105', 181122: '化工Z2106', 181123: '化工2001', 181124: '化工2002', 181125: '化工2003', 181126: '化工2004', 181127: '化工2005', 181128: '化工2006', 181129: '化工S2001', 181130: '化工Z2007', 181131: '化工1901', 181132: '化工1902', 181133: '化工1903', 181134: '化工1904', 181135: '化工S1901', 181136: '化工Z1905'}, 181200: {181211: '过控2201', 181212: '过控2202', 181213: '过控2101', 181214: '过控2102', 181215: '过控2001', 181216: '过控2002', 181217: '过控1901', 181218: '过控1902'}, 181300: {181311: '精化2201', 181312: '精化2101', 181313: '精化2001', 181314: '精化1901'}, 190000: {191100: '矿物加工工程', 191200: '采矿工程', 191300: '城市地下空间工程', 191400: '采矿工程(煤炭智能化)', 191500: '资源勘查工程', 191600: '资源勘查工程(煤及煤层气工程方向)', 191700: '测绘工程', 191800: '地质工程'}, 191100: {191111: '矿物2201', 191112: '矿物2202', 191113: '矿物2203', 191114: '矿物2101', 191115: '矿物2102', 191116: '矿物2103', 191117: '矿物2001', 191118: '矿物2002', 191119: '矿物2003', 191120: '矿物1901', 191121: '矿物1902', 191122: '矿物1903'}, 191200: {191211: '采矿2201', 191212: '采矿2202', 191213: '采矿2203', 191214: '采矿2101', 191215: '采矿2102', 191216: '采矿2103', 191217: '采矿2104', 191218: '采矿2001', 191219: '采矿2002', 191220: '采矿2003', 191221: '采矿2004', 191222: '采矿1901', 191223: '采矿1902', 191224: '采矿1903', 191225: '采矿1904', 191226: '采矿1905', 191227: '采矿1906', 191228: '采矿S1901'}, 191300: {191311: '地工2201', 191312: '地工2202', 191313: '地工2203', 191314: '地工2101', 191315: '地工2102', 191316: '地工2103', 191317: '地工2001', 191318: '地工2002', 191319: '地工2003', 191320: '地工1901', 191321: '地工1902', 191322: '地工1903', 191323: '地工1904'}, 191400: {191411: '智矿2201', 191412: '智矿2202', 191413: '智矿2101', 191414: '智矿2102', 191415: '智矿2001', 191416: '智矿2002'}, 191500: {191511: '资勘2201', 191512: '资勘2202', 191513: '资勘2101', 191514: '资勘2102', 191515: '资勘2103', 191516: '资勘2001', 191517: '资勘2002', 191518: '资勘2003', 191519: '资勘1901', 191520: '资勘1902', 191521: '资勘1903'}, 191600: {191611: '煤层气2201'}, 191700: {191711: '测绘2201', 191712: '测绘2202', 191713: '测绘2203', 191714: '测绘2101', 191715: '测绘2102', 191716: '测绘2103', 191717: '测绘2001', 191718: '测绘2002', 191719: '测绘2003', 191720: '测绘2004', 191721: '测绘1901', 191722: '测绘1902', 191723: '测绘1903', 191724: '测绘1904'}, 191800: {191811: '地质2201', 191812: '地质2202', 191813: '地质2101', 191814: '地质2102', 191815: '地质2001', 191816: '地质2002', 191817: '地质1901', 191818: '地质1902'}, 200000: {201100: '会计学', 201200: '工程管理', 201300: '物流管理', 201400: '工程管理#', 201500: '物流管理（航空物流）', 201600: '国际经济与贸易'}, 201100: {201111: '会计2201', 201112: '会计2202', 201113: '会计2101', 201114: '会计2102', 201115: '会计2103', 201116: '会计2001', 201117: '会计2002', 201118: '会计2003', 201119: '会计1901', 201120: '会计1902'}, 201200: {201211: '工管2201', 201212: '工管2202', 201213: '工管2203', 201214: '工管2101', 201215: '工管2102', 201216: '工管2103', 201217: '工管2001', 201218: '工管2002', 201219: '工管2003', 201220: '工管1901', 201221: '工管1902'}, 201300: {201311: '物流2201', 201312: '物流2202', 201313: '物流2101', 201314: '物流2001', 201315: '物流1901'}, 201400: {201411: '工管G2204', 201412: '工管G2104', 201413: '工管G2004', 201414: '工管G1903', 201415: '工管G1803'}, 201500: {201511: '航物2201', 201512: '航物2101', 201513: '航物2001', 201514: '航物1901'}, 201600: {201611: '国贸2201', 201612: '国贸2202', 201613: '国贸2101', 201614: '国贸2102', 201615: '国贸LZ2101', 201616: '国贸2001', 201617: '国贸2002', 201618: '国贸LZ2001', 201619: '国贸1901', 201620: '国贸1902', 201621: '国贸1903', 201622: '国贸1904'}, 210000: {211100: '法学', 211200: '行政管理', 211300: '汉语国际教育'}, 211100: {211111: '法学2201', 211112: '法学2202', 211113: '法学2203', 211114: '法学2101', 211115: '法学2102', 211116: '法学2103', 211117: '法学2001', 211118: '法学2002', 211119: '法学2003', 211120: '法学1901', 211121: '法学1902', 211122: '法学1903'}, 211200: {211211: '行政2201', 211212: '行政2202', 211213: '行政2101', 211214: '行政2102', 211215: '行政2001', 211216: '行政2002', 211217: '行政1901', 211218: '行政1902'}, 211300: {211311: '汉教2201', 211312: '汉教LZ2201', 211313: '汉教2101', 211314: '汉教2001', 211315: '汉教LZ2001', 211316: '汉教1901', 211317: '汉教1902'}, 220000: {221100: '英语', 221200: '英语（英日双语方向）', 221300: '英语（英俄双语方向）'}, 221100: {221111: '英语2201', 221112: '英语2202', 221113: '英语2203', 221114: '英语2101', 221115: '英语2102', 221116: '英语2103', 221117: '英语2001', 221118: '英语2002', 221119: '英语2003', 221120: '英语1901', 221121: '英语1902'}, 221200: {221211: '英日2201', 221212: '英日2101', 221213: '英日2001', 221214: '英日1901'}, 221300: {221311: '英俄2201', 221312: '英俄2101', 221313: '英俄2001', 221314: '英俄1901'}, 230000: {231100: '思想政治教育'}, 231100: {231111: '思政2201', 231112: '思政2202', 231113: '思政2203', 231114: '思政2101', 231115: '思政2102', 231116: '思政2103', 231117: '思政2001', 231118: '思政2002', 231119: '思政2003', 231120: '思政1901', 231121: '思政1902', 231122: '思政1903'}, 240000: {241100: '体育教育', 241200: '体育教育（赛马方向）', 241300: '运动训练'}, 241100: {241111: '体育2201', 241112: '体育2202', 241113: '体育2203', 241114: '体育2204', 241115: '体育2101', 241116: '体育2102', 241117: '体育2103', 241118: '体育2104', 241119: '体育2001', 241120: '体育2002', 241121: '体育2003', 241122: '体育2004', 241123: '体育1901', 241124: '体育1902', 241125: '体育1903', 241126: '体育1904'}, 241200: {241211: '赛马2201', 241212: '赛马2101', 241213: '赛马2001', 241214: '赛马1901'}, 241300: {241311: '运训2201', 241312: '运训2202'}, 250000: {251100: '数学与应用数学', 251200: '信息与计算科学', 251300: '统计学'}, 251100: {251111: '数学2201', 251112: '数学2101', 251113: '数学2001', 251114: '数学1901', 251115: '数学1902'}, 251200: {251211: '信计2201', 251212: '信计2202', 251213: '信计2101', 251214: '信计2102', 251215: '信计2001', 251216: '信计2002', 251217: '信计2003', 251218: '信计2004', 251219: '信计1901', 251220: '信计1902'}, 251300: {251311: '统计2201', 251312: '统计2202', 251313: '统计2101', 251314: '统计2102', 251315: '统计1901', 251316: '统计1902'}, 260000: {261100: '软件工程'}, 261100: {261111: '软件2201', 261112: '软件2202', 261113: '软件2203', 261114: '软件2204', 261115: '软件2205', 261116: '软件2206', 261117: '软件2207', 261118: '软件2208', 261119: '软件2209', 261120: '软件2210', 261121: '软件2211', 261122: '软件2212', 261123: '软件2213', 261124: '软件2214', 261125: '软件2215', 261126: '软件2216', 261127: '软件2217', 261128: '软件2218', 261129: '软件2219', 261130: '软件2220', 261131: '软件2221', 261132: '软件2222', 261133: '软件2223', 261134: '软件2224', 261135: '软件2225', 261136: '软件2226', 261137: '软件2227', 261138: '软件2228', 261139: '软件2229', 261140: '软件2230', 261141: '软件2231', 261142: '软件2232', 261143: '软件2233', 261144: '软件2234', 261145: '软件2235', 261146: '软件2236', 261147: '软件2237', 261148: '软件2238', 261149: '软件2239', 261150: '软件2240', 261151: '软件2241', 261152: '软件2242', 261153: '软件2243', 261154: '软件2244', 261155: '软件2245', 261156: '软件2246', 261157: '软件2247', 261158: '软件2248', 261159: '软件2101', 261160: '软件2102', 261161: '软件2103', 261162: '软件2104', 261163: '软件2105', 261164: '软件2106', 261165: '软件2107', 261166: '软件2108', 261167: '软件2109', 261168: '软件2110', 261169: '软件2111', 261170: '软件2112', 261171: '软件2113', 261172: '软件2114', 261173: '软件2115', 261174: '软件2116', 261175: '软件2117', 261176: '软件2118', 261177: '软件2119', 261178: '软件2120', 261179: '软件2121', 261180: '软件2122', 261181: '软件2123', 261182: '软件2124', 261183: '软件2125', 261184: '软件2126', 261185: '软件2127', 261186: '软件2128', 261187: '软件2129', 261188: '软件2130', 261189: '软件2131', 261190: '软件2132', 261191: '软件2133', 261192: '软件2134', 261193: '软件2135', 261194: '软件2136', 261195: '软件2137', 261196: '软件2138', 261197: '软件2139', 261198: '软件2140', 261199: '软件2001', 2611100: '软件2002', 2611101: '软件2003', 2611102: '软件2004', 2611103: '软件2005', 2611104: '软件2006', 2611105: '软件2007', 2611106: '软件2008', 2611107: '软件2009', 2611108: '软件2010', 2611109: '软件2011', 2611110: '软件2012', 2611111: '软件2013', 2611112: '软件2014', 2611113: '软件2015', 2611114: '软件2016', 2611115: '软件2017', 2611116: '软件2018', 2611117: '软件2019', 2611118: '软件2020', 2611119: '软件2021', 2611120: '软件2022', 2611121: '软件2023', 2611122: '软件2024', 2611123: '软件2025', 2611124: '软件2026', 2611125: '软件2027', 2611126: '软件2028', 2611127: '软件2029', 2611128: '软件2030', 2611129: '软件2031', 2611130: '软件2032', 2611131: '软件2033', 2611132: '软件2034', 2611133: '软件2035', 2611134: '软件2036'}, 270000: {271100: '电子信息工程', 271200: '通信工程', 271300: '电子科学与技术', 271400: '电子科学与技术（集成电路）', 271500: '智能测控工程', 271600: '光电信息科学与工程', 271700: '智能感知工程', 271800: '测控技术与仪器', 271900: '光源与照明'}, 271100: {271111: '信息2201', 271112: '信息2202', 271113: '信息2101', 271114: '信息2102', 271115: '信息2001', 271116: '信息2002', 271117: '信息2003', 271118: '信息1901', 271119: '信息1902'}, 271200: {271211: '通信2201', 271212: '通信2202', 271213: '通信2101', 271214: '通信2102', 271215: '通信2001', 271216: '通信2002', 271217: '通信1901', 271218: '通信1902'}, 271300: {271311: '电科2201', 271312: '电科2101', 271313: '电科2001', 271314: '电科2002', 271315: '电科1901', 271316: '电科1902'}, 271400: {271411: '集电2201', 271412: '集电2101'}, 271500: {271511: '智测2201', 271512: '智测2202'}, 271600: {271611: '光信息2201', 271612: '光信息2202', 271613: '光信息2203', 271614: '光信息2204', 271615: '光信息2101', 271616: '光信息2102', 271617: '光信息2103', 271618: '光信息2104', 271619: '光信息2001', 271620: '光信息2002', 271621: '光信息2003', 271622: '光信息2004', 271623: '光信息1901', 271624: '光信息1902', 271625: '光信息1903', 271626: '光信息1904'}, 271700: {271711: '感知2201', 271712: '感知2202', 271713: '感知2101', 271714: '感知2102'}, 280000: {281100: '纺织工程', 281200: '服装与服饰设计', 281300: '服装与服饰设计（服装设计与表演方向）'}, 281100: {281111: '纺织2201', 281112: '纺织2202', 281113: '纺织2101', 281114: '纺织2102', 281115: '纺织2001', 281116: '纺织2002', 281117: '纺织1901', 281118: '纺织1902'}, 281200: {281211: '服设2201', 281212: '服设2202', 281213: '服设2101', 281214: '服设2102', 281215: '服设2001', 281216: '服设2002', 281217: '服设1901', 281218: '服设1902'}, 281300: {281311: '服表2201', 281312: '服表2101', 281313: '服表2001', 281314: '服表1901', 281315: '服表1902'}, 290000: {291100: '环境设计', 291200: '视觉传达设计', 291300: '数字媒体艺术', 291400: '绘画', 291500: '工艺美术', 291600: '音乐表演', 291700: '舞蹈表演', 291800: '文物保护与修复', 291900: '文物保护技术'}, 291100: {291111: '环艺2201', 291112: '环艺2202', 291113: '环艺2203', 291114: '环艺2101', 291115: '环艺2102', 291116: '环艺2103', 291117: '环艺2001', 291118: '环艺2002', 291119: '环艺2003', 291120: '环艺1901', 291121: '环艺1902', 291122: '环艺1903'}, 291200: {291211: '视觉2201', 291212: '视觉2202', 291213: '视觉2203', 291214: '视觉2101', 291215: '视觉2102', 291216: '视觉2103', 291217: '视觉2001', 291218: '视觉2002', 291219: '视觉2003', 291220: '视觉1901', 291221: '视觉1902', 291222: '视觉1903'}, 291300: {291311: '媒体2201', 291312: '媒体2202', 291313: '媒体2101', 291314: '媒体2102', 291315: '媒体2001', 291316: '媒体2002', 291317: '媒体1901', 291318: '媒体1902'}, 291400: {291411: '国画2201', 291412: '油画2201', 291413: '国画2101', 291414: '国画2102', 291415: '油画2101', 291416: '国画2001', 291417: '国画2002', 291418: '油画2001', 291419: '油画2002', 291420: '国画1901', 291421: '国画1902', 291422: '油画1901', 291423: '油画1902'}, 291500: {291511: '工艺2201', 291512: '工艺2202', 291513: '工艺2101', 291514: '工艺2102', 291515: '工艺2001', 291516: '工艺2002', 291517: '工艺2003', 291518: '工艺1901', 291519: '工艺1902', 291520: '工艺1903'}, 291600: {291611: '音表2201', 291612: '音表2202', 291613: '音表2101'}, 291700: {291711: '舞表2201', 291712: '舞表2101'}, 300000: {301100: '制药工程', 301200: '生物医学工程'}, 301100: {301111: '制药2201', 301112: '制药2202', 301113: '制药2203', 301114: '制药2101', 301115: '制药2102', 301116: '制药2103', 301117: '制药2001', 301118: '制药2002', 301119: '制药2003', 301120: '制药1901', 301121: '制药1902', 301122: '制药1903'}, 301200: {301211: '生医2201', 301212: '生医2202', 301213: '生医2203', 301214: '生医2101', 301215: '生医2102', 301216: '生医2103', 301217: '生医2001', 301218: '生医2002', 301219: '生医2003', 301220: '生医1901', 301221: '生医1902', 301222: '生医1903'}, 310000: {311100: '安全工程', 311200: '应急技术与管理'}, 311100: {311111: '安全2201', 311112: '安全2202', 311113: '安全2203', 311114: '安全2204', 311115: '安全2205', 311116: '安全2101', 311117: '安全2102', 311118: '安全2103', 311119: '安全2104', 311120: '安全Z2105', 311121: '安全2001', 311122: '安全2002', 311123: '安全2003', 311124: '安全2004', 311125: '安全Z2005', 311126: '安全1901', 311127: '安全1902', 311128: '安全1903', 311129: '安全1904', 311130: '安全Z1905'}, 311200: {311211: '应急2201', 311212: '应急2202', 311213: '应急2101', 311214: '应急2102', 311215: '应急2001', 311216: '应急2002', 311217: '应急1901', 311218: '应急1902'}, 320000: {321100: '工业设计', 321200: '建筑学', 321300: '城乡规划'}, 321100: {321111: '工设2201', 321112: '工设2202', 321113: '工设2101', 321114: '工设2102', 321115: '工设2001', 321116: '工设2002', 321117: '工设1901', 321118: '工设1902'}, 321200: {321211: '建筑学2201', 321212: '建筑学2202', 321213: '建筑学2203', 321214: '建筑学2101', 321215: '建筑学2102', 321216: '建筑学2103', 321217: '建筑学2001', 321218: '建筑学2002', 321219: '建筑学2003', 321220: '建筑学1901', 321221: '建筑学1902', 321222: '建筑学1903', 321223: '建筑学1801', 321224: '建筑学1802', 321225: '建筑学1803'}, 321300: {321311: '城规2201', 321312: '城规2202', 321313: '城规2101', 321314: '城规2102', 321315: '城规2001', 321316: '城规2002', 321317: '城规1901', 321318: '城规1902', 321319: '城规1801'}, 330000: {331100: '飞行器设计与工程', 331200: '机械电子工程（飞行技术方向）', 331300: '机械设计制造及其自动化（飞行器设计）'}, 331100: {331111: '飞设2201', 331112: '飞设2202', 331113: '飞设2203', 331114: '飞设2101', 331115: '飞设2102', 331116: '飞设2103', 331117: '飞设2001', 331118: '飞设2002'}, 340000: {341100: '机械设计制造及其自动化（中外合办）'}, 341100: {341111: '机械H2201', 341112: '机械H2202', 341113: '机械H2203', 341114: '机械H2204', 341115: '机械H2101', 341116: '机械H2102', 341117: '机械H2103', 341118: '机械H2104', 341119: '机械H2001', 341120: '机械H2002', 341121: '机械H2003', 341122: '机械H2004'}, 350000: {351100: '试验班'}, 351100: {351111: '试验2201', 351112: '试验2202', 351113: '试验2203', 351114: '试验2204', 351115: '试验2101', 351116: '试验2102', 351117: '试验2103', 351118: '试验2104'}, 360000: {361100: '应用化学'}, 361100: {361111: '应化2201', 361112: '应化2202', 361113: '应化2101', 361114: '应化2102', 361115: '应化1901', 361116: '应化1902'}, 370000: {371100: '应用物理学', 371200: '应用物理学（微电子）'}, 371100: {371111: '应物2201', 371112: '应物2202', 371113: '应物2101', 371114: '应物2001', 371115: '应物2002', 371116: '应物1901', 371117: '应物1902'}, 141800: {141811: '信安2101', 141812: '信安2102', 141813: '信安1901', 141814: '信安1902'}, 380000: {381100: '留学生汉语进修'}, 381100: {381111: '留学LH2101'}, 271800: {271811: '测控2101', 271812: '测控2102', 271813: '测控1901', 271814: '测控1902'}, 291800: {291811: '文保2101', 291812: '文保2102'}, 371200: {371211: '微电子2101'}, 121600: {121611: '航空2001', 121612: '航空1901'}, 291900: {291911: '文物2001', 291912: '文物2002', 291913: '文物1901', 291914: '文物1902'}, 111600: {111611: '飞机1901'}, 271900: {271911: '光照1901', 271912: '光照1902'}, 331200: {331211: '机电F1901'}, 331300: {331311: '机械F1901'}}  
  
  ;

  var WINDOW = typeof window !== 'undefined' ? window : {};
  var NAMESPACE = 'distpicker';
  var EVENT_CHANGE = 'change';

  var DEFAULT_CODE = 100000;
  var PROVINCE = 'province';
  var CITY = 'city';
  var DISTRICT = 'district';

  var Distpicker = /*#__PURE__*/function () {
    function Distpicker(element, options) {
      _classCallCheck(this, Distpicker);

      this.$element = $__default['default'](element);
      this.options = $__default['default'].extend({}, DEFAULTS, $__default['default'].isPlainObject(options) && options);
      this.placeholders = $__default['default'].extend({}, DEFAULTS);
      this.ready = false;
      this.init();
    }

    _createClass(Distpicker, [{
      key: "init",
      value: function init() {
        var _this = this;

        var options = this.options;
        var $selects = this.$element.find('select');
        var length = $selects.length;
        var data = {};
        $selects.each(function (i, select) {
          return $__default['default'].extend(data, $__default['default'](select).data());
        });
        $__default['default'].each([PROVINCE, CITY, DISTRICT], function (i, type) {
          if (data[type]) {
            options[type] = data[type];
            _this["$".concat(type)] = $selects.filter("[data-".concat(type, "]"));
          } else {
            _this["$".concat(type)] = length > i ? $selects.eq(i) : null;
          }
        });
        this.bind(); // Reset all the selects (after event binding)

        this.reset();
        this.ready = true;
      }
    }, {
      key: "bind",
      value: function bind() {
        var _this2 = this;

        if (this.$province) {
          this.$province.on(EVENT_CHANGE, this.onChangeProvince = $__default['default'].proxy(function () {
            _this2.output(CITY);

            _this2.output(DISTRICT, true);
          }, this));
        }

        if (this.$city) {
          this.$city.on(EVENT_CHANGE, this.onChangeCity = $__default['default'].proxy(function () {
            return _this2.output(DISTRICT, true);
          }, this));
        }
      }
    }, {
      key: "unbind",
      value: function unbind() {
        if (this.$province) {
          this.$province.off(EVENT_CHANGE, this.onChangeProvince);
        }

        if (this.$city) {
          this.$city.off(EVENT_CHANGE, this.onChangeCity);
        }
      }
    }, {
      key: "output",
      value: function output(type) {
        var triggerEvent = arguments.length > 1 && arguments[1] !== undefined ? arguments[1] : false;
        var options = this.options,
            placeholders = this.placeholders;
        var $select = this["$".concat(type)];

        if (!$select || !$select.length) {
          return;
        }

        var code;

        switch (type) {
          case PROVINCE:
            code = DEFAULT_CODE;
            break;

          case CITY:
            code = this.$province && (this.$province.find(':selected').data('code') || '');
            break;

          case DISTRICT:
            code = this.$city && (this.$city.find(':selected').data('code') || '');
            break;
        }

        var districts = this.getDistricts(code);
        var value = options[type];
        var data = [];
        var matched = false;

        if ($__default['default'].isPlainObject(districts)) {
          $__default['default'].each(districts, function (i, name) {
            var selected = name === value || i === String(value);

            if (selected) {
              matched = true;
            }

            data.push({
              name: name,
              selected: selected,
              code: i,
              value: options.valueType === 'name' ? name : i
            });
          });
        }

        if (!matched) {
          var autoselect = options.autoselect || options.autoSelect;

          if (data.length && (type === PROVINCE && autoselect > 0 || type === CITY && autoselect > 1 || type === DISTRICT && autoselect > 2)) {
            data[0].selected = true;
          } // Save the unmatched value as a placeholder at the first output


          if (!this.ready && value) {
            placeholders[type] = value;
          }
        } // Add placeholder option


        if (options.placeholder) {
          data.unshift({
            code: '',
            name: placeholders[type],
            value: '',
            selected: false
          });
        }

        if (data.length) {
          $select.html(this.getList(data));
        } else {
          $select.empty();
        }

        if (triggerEvent) {
          $select.trigger(EVENT_CHANGE);
        }
      } // eslint-disable-next-line class-methods-use-this

    }, {
      key: "getList",
      value: function getList(data) {
        var list = [];
        $__default['default'].each(data, function (i, n) {
          var attrs = ["data-code=\"".concat(n.code, "\""), "data-text=\"".concat(n.name, "\""), "value=\"".concat(n.value, "\"")];

          if (n.selected) {
            attrs.push('selected');
          }

          list.push("<option ".concat(attrs.join(' '), ">").concat(n.name, "</option>"));
        });
        return list.join('');
      } // eslint-disable-next-line class-methods-use-this

    }, {
      key: "getDistricts",
      value: function getDistricts() {
        var code = arguments.length > 0 && arguments[0] !== undefined ? arguments[0] : DEFAULT_CODE;
        return DISTRICTS[code] || null;
      }
    }, {
      key: "reset",
      value: function reset(deep) {
        if (!deep) {
          this.output(PROVINCE);
          this.output(CITY);
          this.output(DISTRICT);
        } else if (this.$province) {
          this.$province.find(':first').prop('selected', true).end().trigger(EVENT_CHANGE);
        }
      }
    }, {
      key: "destroy",
      value: function destroy() {
        this.unbind();
      }
    }], [{
      key: "setDefaults",
      value: function setDefaults(options) {
        $__default['default'].extend(DEFAULTS, $__default['default'].isPlainObject(options) && options);
      }
    }]);

    return Distpicker;
  }();

  if ($__default['default'].fn) {
    var AnotherDistpicker = $__default['default'].fn.distpicker;

    $__default['default'].fn.distpicker = function jQueryDistpicker(option) {
      for (var _len = arguments.length, args = new Array(_len > 1 ? _len - 1 : 0), _key = 1; _key < _len; _key++) {
        args[_key - 1] = arguments[_key];
      }

      var result;
      this.each(function (i, element) {
        var $element = $__default['default'](element);
        var isDestroy = option === 'destroy';
        var distpicker = $element.data(NAMESPACE);

        if (!distpicker) {
          if (isDestroy) {
            return;
          }

          var options = $__default['default'].extend({}, $element.data(), $__default['default'].isPlainObject(option) && option);
          distpicker = new Distpicker(element, options);
          $element.data(NAMESPACE, distpicker);
        }

        if (typeof option === 'string') {
          var fn = distpicker[option];

          if ($__default['default'].isFunction(fn)) {
            result = fn.apply(distpicker, args);

            if (isDestroy) {
              $element.removeData(NAMESPACE);
            }
          }
        }
      });
      return typeof result === 'undefined' ? this : result;
    };

    $__default['default'].fn.distpicker.Constructor = Distpicker;
    $__default['default'].fn.distpicker.setDefaults = Distpicker.setDefaults;

    $__default['default'].fn.distpicker.noConflict = function noConflict() {
      $__default['default'].fn.distpicker = AnotherDistpicker;
      return this;
    };
  }

  if (WINDOW.document) {
    $__default['default'](function () {
      $__default['default']("[data-toggle=\"".concat(NAMESPACE, "\"]")).distpicker();
    });
  }

})));
